app/Controllers/Data.php

    public function getECP(){
        $ecp = new EcpModel();
		$query = $ecp->orderBy('id','ASC')->findAll();
		$count = $ecp->orderBy('id','ASC')->countAllResults();
---
SELECT *
FROM `ecp`
ORDER BY `id` ASC
SELECT COUNT(*) AS `numrows`
FROM `ecp`