app/Models/EcpModel.php

INSERT INTO `ecp` (`customer_cd`, `customer_name`, `payment_term_cd`, `customer_alert_1`, `customer_alert_2`, `customer_alert_3`, `promo_code`, `bu`, `promo_type`, `promo_name`, `promo_start_date`, `promo_end_date`, `promo_details`, `region`, `routecode`, `routename`, `show_price`, `leave_bill`, `store_comment`, `logis_remark`, `morning_only`, `evening_only`, `working_day_only`, `logis_note`, `logis_note2`, `logis_delivery`, `logis_comment`, `c_customer_parent_group`, `c_experts`, `c_partner`, `nikon_lenswear_partner`, `upgrade_coating`, `upgrade_azio`, `upgrade_f360`) VALUES ('BO0002', 'บริษัท โอ ทู พลัส จำกัด', 'CREDIT', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'No', 'No', 'No')
---
	public function insertValue($data){
		$builder = $this->db->table('ecp');
		return $builder->insert($data);